const { numbersModule } = require('./numbersModule')


const MAX = '9007199254740991'.length

console.log("Максимальное чило в js =", 9007199254740991);

console.log("\nПроверка на сложение\n")

console.log("123456789101112123456789101112", "+", '123456789101112123456789101112');
console.log('Мой метод = ', numbersModule.sumBig('123456789101112123456789101112', '123456789101112123456789101112'))



let test = BigInt('123456789101112123456789101112') + BigInt('123456789101112123456789101112')

console.log("То что должно получится =", test)



console.log("\nПроверка на разность\n")

console.log('123456781234567812345678 - 123456781234567812345677');

console.log('Мой метод =', numbersModule.subBig('123456781234567812345678', '123456781234567812345677'));
console.log('То что должно получится', 1);


console.log("\nПроверка на умножение\n")

console.log('46546878465468758347563475634756347563745 * 2');
console.log('мой метод = ', numbersModule.multiply('46546878465468758347563475634756347563745', '2'));

let mul = BigInt('46546878465468758347563475634756347563745') * BigInt('2')
console.log("То что должно получится =", mul)






